---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Arc..::..Create Method
Arc Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Create(XYZ, XYZ, XYZ) | Creates a new geometric arc object based on three points. |
|  | Create(Plane, Double, Double, Double) | Creates a new geometric arc object based on plane, radius, and angles. |
|  | Create(XYZ, Double, Double, Double, XYZ, XYZ) | Creates a new geometric arc object based on center, radius, unit vectors, and angles. |

# See Also

Arc Class

Arc Members

Autodesk.Revit.DB Namespace